{
    "quote": [
        {
            "locale": "en",
            "content": "\"You're The Best Of All Of Us. You're On Your Way. Just Keep Going.\"",
            "author": "Spider-Man: Across the Spider-Verse"
        },
        {
            "locale": "ja",
            "content": "「君は僕たちの中で一番だ。自分の道を進んでる。そのまま進み続けろ。」",
            "author": "『スパイダーマン：アクロス・ザ・スパイダーバース』"
        },
        {
            "locale": "es",
            "content": "\"Eres el mejor de todos nosotros. Estás en tu camino, Sólo sigue adelante.\"",
            "author": "Spider-Man: Cruzando el Multiverso"
        }
    ],
    "card": [
        {
            "locale": "en",
            "work": "Programmer | Artist | Designer",
            "type": "Full-Stack Developer"
        },
        {
            "locale": "ja",
            "work": "プログラムー｜アーティスト｜デザイナー",
            "type": "フルスタックエンジニア"
        },
        {
            "locale": "es",
            "work": "Programador | Artista | Diseñador",
            "type": "Desarrollador Full-Stack"
        }
    ],
    "about": [
        {
            "locale": "en",
            "content": "I studied Computer Science at Gannon University. I was inspired to start this journey since I was in high school after watching a video regarding programming. At that moment I knew that this was the path which I yearn to walk, no matter what challenges might step in my way."
        },
        {
            "locale": "ja",
            "content": "私はギャノン大学でコンピュターサイエンスを専攻していました。学校ではプログラミングの動画を見たり、プロジェクトを立ち上げたりしています。初めてのプロジェクトは楽しかったです。そして、より多くのプログラミングの勉強とプロジェクトを進めれるように精進しています。"
        },
        {
            "locale": "es",
            "content": "Estudie Computer Science en Gannon University. Mi inspiración para empezar mi aventura proviene de un video el cual se presentó en mi escuela sobre la programación de videojuegos, En ese momento supe este era el camino que anhelaba caminar, sin importar que retos se presenten en mi camino."
        }
    ],
    "experience": [
        {
            "locale": "en",
            "content": "Besides the tasks given in class, I decided to obtain more experience by doing my own projects. I have taken some online classes which two of them have given me certificates while the others where just practice. Besides classes I tried to adventure myself by making a sorting algorithm for excel files, some websites to improve my abilities not just as back-end but also front-end, etc. I love exploring new languages and taking up new challenges."
        },
        {
            "locale": "ja",
            "content": "毎日、放課後はプログラミングプロジェクト仕事をしました。オンラインプログラミング授業の証明書が二つあります。WebサイトとゲームとAIなどプロジェクトを作成しました。新しいプログラミング言語を使用することがすきです。"
        },
        {
            "locale": "es",
            "content": "Además, tareas dadas en clase, Yo decidí obtener más experiencia desarrollando mis propios proyectos. Tome algunas clases en línea el cual dos de ellos me cedieron certificados mientras las otras solo fueron prácticas. Además, decidí aventurarme al crear un algoritmo de clasificación para archivos Excel, algunas páginas web para mejorar mis habilidades no solo como back-end pero también como un front-end, etc. A mí me encanta explorar nuevos lenguajes y tomar nuevos retos."
        }
    ],
    "others": [
        {
            "locale": "en",
            "content": "My main editor is Neovim but, I also have experience using Visual Studio, VSCode, and JetBrains. I started using Neovim because I had heard that it was very powerful but too complicated to learn, I am the type of person who enjoys challenges and took on the challenge of learning it. The language I enjoy programming the most is C++, but I am also familiar with other languages and love learning more."
        },
        {
            "locale": "ja",
            "content": "私のプログラミングエディターはNeovimです。また、VisualStudioとVSCodeとJetBrainsのIDEを時々を使います。Neovimは便利なエディターであるが、少しい使用するには苦労します。私が最も得意なプログラミング言語はC++です。ですが、他にも色々なプログラミング言語を使用できます。"
        },
        {
            "locale": "es",
            "content": "Mi editor principal es Neovim, pero también tengo experiencia usando Visual Studio, VSCode, y JetBrains. Empecé usando Neovim porque escuche que era bastante complicado, pero también difícil de aprender, yo soy el tipo de persona que le gusta tomar retos y decidí tomar el reto de aprenderlo. El lenguaje el cual disfruto más programar es C++, pero también estoy familiarizado con otros lenguajes e idolatro aprender más."
        }
    ],
    "timeline": [
        {
            "locale": "en",
            "title": "Timeline",
            "first award": "High school award, Software Development",
            "president club": "President of the high school computer club",
            "second award": "Second high school award, Software Development",
            "dinant intern": "Internship as Full-Stack Developer at Dinant",
            "tag research": "AI Research Assistant",
            "tag publication": "Published AI Research",
            "bachelor": "Graduated from Gannon University"
        },
        {
            "locale": "ja",
            "title": "タイムライン",
            "first award": "学内でソフトウェア賞受賞",
            "president club": "コンピュータクラブの会長就任",
            "second award": "学内でソフトウェア賞受賞",
            "dinant intern": "Dinantでフルスタックエンジニアインターン勤務",
            "tag research": "AI研究助手として勤務",
            "tag publication": "AI研究を掲載しました",
            "bachelor": "ギャノン大学進学"
        },
        {
            "locale": "es",
            "title": "Línea de Tiempo",
            "first award": "Premio escolar, Desarrollo de Software",
            "president club": "Presidente escolar del club de computación",
            "second award": "Segundo premio escolar, Desarrollo de Software",
            "dinant intern": "Pasantia como Full-Stack Developer en Dinant",
            "tag research": "Assistente, Estudio de Intelligencia Artificial",
            "tag publication": "Papel de Intelligencia Artificial Publicado",
            "bachelor": "Graduado en Gannon University"
        }
    ]
}
