{
    "description": [
        {
            "locale": "en",
            "content": "In a team of three, we engineered an industrial traceability system to automatically detect and log pallet movements inside a production facility. The previous workflow relied on manual inspection of damaged pallets, resulting in delays and human error.\n\nThe system used dual cameras to detect motion and generate event-based records containing captured images and object detections. These events were processed using Ultralytics YOLO running on NVIDIA Jetson (migrated from Arduino due to overheating and computational limitations) and stored in TimescaleDB. A custom web platform provided real-time visualization and system control."
        },
        {
            "locale": "ja",
            "content": "大学生の時、三人のチームでトレーサビリティシステムを開発しました。会社では、破損したパレットがよく持ち込まれていましたが、社員が手作業でダメージを確認していたため、時間がかかり、ミスも多くありました。それで、このシステムではパレットの破損を自動で検出します。会社の中にはドアの隣に2台のカメラが設置されています。そして、カメラは動きを検知し、パレットを見つけると写真を撮ります。あとで、その写真はwebサイトにアップロードされ、破損が検出された場合、会社員にメールで通知されます。"
        },
        {
            "locale": "es",
            "content": "En mi equipo de tres, desarollamos un systema de trazibilidad que detecta objetos pasando enfrente de uan camara. La idea era que la maquina recolectaba detectiones de cajas de paqueteria y los guardaba en eventos. Con estos eventos podemos detectar abnormalidades en la transferencia de paquetes como daños. Despues es enviado a una base de datos el cual puedes acceder a travez de un web application para vizualisar los datos."
        }
    ],

    "EnginnerOwnerAndDecision": [
        {
            "locale": "en",
            "content": "Engineering Decisions & Ownership",
            "list": [
                "Migrated hardware from Arduino to NVIDIA Jetson to resolve thermal and performance constraints.",
                "Containerized backend services using Docker for reliable deployment.",
                "Designed event-based database modeling for scalable storage and retrieval.",
                "Developed 100% of the web interface and contributed ~50% across backend, hardware integration, and AI deployment.",
                "Implemented image deletion, detection editing, and retraining pipeline integration."
            ]
        }
    ],

    "OperationalBusinessImpact": [
        {
            "locale": "en",
            "content": "Operational & Business Impact",
            "list": [
                "Conducted bi-weekly progress demonstrations to secondary management.",
                "Presented milestone reviews to executive leadership at mid-project and final phases.",
                "Secured continued funding based on measurable progress and system validation.",
                "Project continuation depended on performance delivery; failure to meet milestones would have resulted in termination."
            ]
        }
    ]
}
